export type Box = { x: number; y: number; w: number; h: number };

export const HARBOR_OBJECTS: Record<string, Box[]> = {
  A: [{ x: 16, y: 47, w: 11, h: 22 }],
  B: [{ x: 47, y: 58, w: 23, h: 23 }],
  C: [{ x: 36, y: 36, w: 18, h: 25 }, { x: 52, y: 25, w: 25, h: 22 }],
  D: [{ x: 64, y: 48, w: 14, h: 22 }],
  E: [{ x: 4, y: 70, w: 12, h: 20 }, { x: 65, y: 78, w: 12, h: 18 }],
  F: [{ x: 5, y: 67, w: 10, h: 10 }, { x: 21, y: 78, w: 13, h: 10 }, { x: 53, y: 78, w: 10, h: 8 }],
  G: [{ x: 22, y: 33, w: 22, h: 30 }],
  H: [{ x: 42, y: 5, w: 9, h: 30 }],
  I: [{ x: 80, y: 22, w: 14, h: 18 }],
  J: [{ x: 4, y: 18, w: 10, h: 28 }],
  K: [{ x: 17, y: 0, w: 30, h: 35 }],
  L: [{ x: 88, y: 4, w: 9, h: 45 }],
  M: [{ x: 65, y: 0, w: 12, h: 12 }, { x: 75, y: 5, w: 14, h: 14 }, { x: 62, y: 56, w: 14, h: 22 }],
  N: [{ x: 16, y: 70, w: 22, h: 22 }],
  O: [{ x: 33, y: 68, w: 22, h: 28 }],
  P: [{ x: 22, y: 53, w: 17, h: 30 }],
  Q: [{ x: 86, y: 60, w: 12, h: 32 }],
  R: [{ x: 11, y: 60, w: 8, h: 32 }],
  S: [{ x: 56, y: 26, w: 32, h: 22 }],
  T: [{ x: 0, y: 50, w: 9, h: 20 }],
  U: [{ x: 1, y: 3, w: 11, h: 17 }],
  V: [{ x: 15, y: 0, w: 7, h: 8 }],
  W: [
  { x: 55, y: 55, w: 35, h: 20 },   // الموج عند السفينة الكبيرة
  { x: 30, y: 70, w: 30, h: 20 },   // الموج في وسط البحر
  { x: 60, y: 75, w: 25, h: 18 }    // الموج عند الدولفين
],
  X: [{ x: 35, y: 88, w: 22, h: 10 }],
  Y: [{ x: 76, y: 47, w: 22, h: 22 }],
  Z: [{ x: 16, y: 27, w: 18, h: 8 }],
};

// أبعاد صورة الميناء الأصلية
export const HARBOR_IMAGE = {
  width: 1537,
  height: 1023,
  src: '/images/harbor-hamburg.png',
};